app/views/organisms/new.html.erb


<% User.find(current_user).nature_lover_level += 1 %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]