app/views/organisms/show.html.erb

SELECT "users".id FROM "users" INNER JOIN "walks" ON "users"."id" = "walks"."user_id" WHERE "walks"."organism_id" = ?  [["organism_id", 10]]
---

<% @organism.users.each do |user| %>