app/views/users/show.html.erb

<h3>Sightings:</h3>
<% @user.organisms.each do |organism| %>
---
SELECT "organisms".* FROM "organisms" INNER JOIN "walks" ON "organisms"."id" = "walks"."organism_id" WHERE "walks"."user_id" = ?  [["user_id", 1]]