app/controllers/organisms_controller.rb

SELECT "organisms".* FROM "organisms"
---
  def index
    @organisms = Organism.all

SELECT  "organisms".* FROM "organisms" WHERE "organisms"."species" IS NULL LIMIT 1
INSERT INTO "organisms" ("species", "group", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["species", ""], ["group", ""], ["location", ""], ["created_at", "2016-08-28 17:52:26.986009"], ["updated_at", "2016-08-28 17:52:26.986009"]]
SELECT "users".* FROM "users" INNER JOIN "walks" ON "users"."id" = "walks"."user_id" WHERE "walks"."organism_id" = ?  [["organism_id", 17]]
---
  def create
    @organism = Organism.find_by(species: params[:species])

     #if @organism.id == nil
      @organism = Organism.create(organism_params)
      binding.pry
      @organism.users << User.find(current_user)

SELECT  "organisms".* FROM "organisms" WHERE "organisms"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @organism = Organism.find(params[:id])