app/controllers/organisms_controller.rb

  def create

      @organism = Organism.create(organism_params)
      walk_user = User.find(current_user)
      walk_user.add_to_nature_lover_level
      walk_user.save
      @organism.users << walk_user
---
UPDATE "users" SET "nature_lover_level" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["nature_lover_level", 1], ["updated_at", "2016-08-29 00:05:16.204817"], ["id", 1]]
INSERT INTO "walks" ("organism_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["organism_id", 16], ["user_id", 1], ["created_at", "2016-08-28 18:21:25.437891"], ["updated_at", "2016-08-28 18:21:25.437891"]]