app/controllers/sessions_controller.rb

  def create
      @user = User.find_by(name: params[:user][:name])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "KhaledaNYC"]]