app/controllers/users_controller.rb

INSERT INTO "users" ("name", "password_digest", "height", "happiness", "nausea", "tickets") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Amy Poehler"], ["password_digest", "$2a$04$Fh9n62KCCBTKcQWK4NzBs.s0dSZNH2X0MSQo0nkcLgfjpVQIdLPVC"], ["height", 58], ["happiness", 3], ["nausea", 2], ["tickets", 15]]
---
  def create
    @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "interest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["interest", "birds"], ["updated_at", "2016-08-28 20:40:51.708067"], ["id", 1]]
---
  def update
  @user = User.find(params[:id])
    if @user.update(user_params)